<template>
    <v-dialog @input="$listeners.input" :value="value" scrollable width="640">
        <v-card tile>
            <v-card-title class="subheading pa-3 grey lighten-3" primary-title>
                <div>Калькулятор процедур в сфере строительства Тамбовской области</div>
                <v-spacer/>
                <v-btn @click="$listeners.input(false)" flat small icon class="ma-0" color="grey darken-1">
                    <v-icon>fa-times</v-icon>
                </v-btn>
            </v-card-title>
            <v-card-text style="max-height:456px">
                <p>Калькулятор процедур в сфере строительства должен «сопровождать» застройщика на каждом шагу оформления документов в процессе строительства, должны содержать необходимые ссылки на документы, адреса и реквизиты выдающих и согласующих документы инстанций.</p>
                <p>Калькулятор процедур в сфере строительства должен содержать информацию о документальном сопровождении на всех этапах строительства, которую необходимо знать застройщику (имеющему земельный участок), начиная от получения ГПЗУ до регистрации права собственности на построенный объект капитального строительства.</p>
                <p>Задав тип планируемого объекта, а также градостроительные условия и ограничения развития территорий, застройщик заранее сможет получить исчерпывающую информацию о последовательности прохождения процедур, о документах, сроках, стоимости процедур, органах и организациях, куда следует обратиться. Выбор параметров строительного объекта и их поэтапное уточнение, начиная от назначения объекта до проецированного программой модели действий упрощающей работу застройщика при проектировании объекта.</p>
                <p>Для использования сервиса рекомендуется использовать актуальные версии браузеров Chrome, Safari, Firefox, Edge.</p>
            </v-card-text>
        </v-card>
    </v-dialog>
</template>
<script lang="ts">
    import Vue from "vue";

    export default Vue.extend<{}, {}, {}, {
        value: boolean
    }>({
        name: 'HelpView',
        props: {
            value: {required: true, type: Boolean}
        }
    })
</script>
<style></style>